iarsystems/ewarm-toshiba-example-projects/TMPM475/Libraries/TX04_CMSIS/TMPM475.h
/**
 *******************************************************************************
 * @file    TMPM475.h
 * @brief   CMSIS Cortex-M4 Core Peripheral Access Layer Header File for the
 *          TOSHIBA 'TMPM475' Device Series
 * @version V2.0.2.5 (Tentative)
 * @date    2015/03/06
 * 
 * DO NOT USE THIS SOFTWARE WITHOUT THE SOFTWARE LISENCE AGREEMENT.
 * 
 * (C)Copyright TOSHIBA CORPORATION 2015 All rights reserved
 *******************************************************************************
 */

/** @addtogroup TOSHIBA_TX04_MICROCONTROLLER
  * @{
  */
  
/** @addtogroup TMPM475
  * @{
  */

#ifndef __TMPM475_H__
#define __TMPM475_H__

#ifdef __cplusplus
extern "C" {
#endif

/** @addtogroup Configuration_of_CMSIS
  * @{
  */

/** Interrupt Number Definition */
typedef enum IRQn
{
/******  Cortex-M4 Processor Exceptions Numbers ***************************************************************/
  NonMaskableInt_IRQn           = -14,       /*!< 2 Non Maskable Interrupt                                    */
  HardFault_IRQn                = -13,       /*!< 3 Cortex-M4 Hard Fault Interrupt                            */
  MemoryManagement_IRQn         = -12,       /*!< 4 Cortex-M4 Memory Management Interrupt                     */
  BusFault_IRQn                 = -11,       /*!< 5 Cortex-M4 Bus Fault Interrupt                             */
  UsageFault_IRQn               = -10,       /*!< 6 Cortex-M4 Usage Fault Interrupt                           */
  SVCall_IRQn                   = -5,        /*!< 11 Cortex-M4 SV Call Interrupt                              */
  DebugMonitor_IRQn             = -4,        /*!< 12 Cortex-M4 Debug Monitor Interrupt                        */
  PendSV_IRQn                   = -2,        /*!< 14 Cortex-M4 Pend SV Interrupt                              */
  SysTick_IRQn                  = -1,        /*!< 15 Cortex-M4 System Tick Interrupt                          */

/******  TMPM475 Specific Interrupt Numbers *******************************************************************/
  INT0_IRQn                     = 0,         /*!< Interrupt pin (PH0/AINA0/INT0)                              */
  INT1_IRQn                     = 1,         /*!< Interrupt pin (PH1/AINA1/INT1)                              */
  INT2_IRQn                     = 2,         /*!< Interrupt pin (PH2/AINA2/INT2)                              */
  INT3_IRQn                     = 3,         /*!< Interrupt pin (PA0/TB0IN/INT3)                              */
  INT4_IRQn                     = 4,         /*!< Interrupt pin (PA2/TB1IN/INT4)                              */
  INT5_IRQn                     = 5,         /*!< Interrupt pin (PE4/TB2IN/INT5)                              */
  INTRX0_IRQn                   = 6,         /*!< Serial reception (channel 0)                                */
  INTTX0_IRQn                   = 7,         /*!< Serial transmit (channel 0)                                 */
  INTRX1_IRQn                   = 8,         /*!< Serial reception (channel 1)                                */
  INTTX1_IRQn                   = 9,         /*!< Serial transmit (channel 1)                                 */
  INTVCN0_IRQn                  = 10,        /*!< Vector Engine interrupt 0                                   */
  INTVCN1_IRQn                  = 11,        /*!< Vector Engine interrupt 1                                   */
  INTEMG0_IRQn                  = 12,        /*!< PMD0 EMG interrupt                                          */
  INTEMG1_IRQn                  = 13,        /*!< PMD1 EMG interrupt                                          */
  INTOVV0_IRQn                  = 14,        /*!< PMD0 OVV interrupt                                          */
  INTOVV1_IRQn                  = 15,        /*!< PMD1 OVV interrupt                                          */
  INTADAPDA_IRQn                = 16,        /*!< ADC unit A conversion triggered by PMD0 is finished         */
  INTADBPDA_IRQn                = 17,        /*!< ADC unit B conversion triggered by PMD0 is finished         */
  INTADAPDB_IRQn                = 18,        /*!< ADC unit A conversion triggered by PMD1 is finished         */
  INTADBPDB_IRQn                = 19,        /*!< ADC unit B conversion triggered by PMD1 is finished         */
  INTTB00_IRQn                  = 20,        /*!< 16bit TMRB0 compare match detection 0 / Over flow           */
  INTTB01_IRQn                  = 21,        /*!< 16bit TMRB0 compare match detection 1                       */
  INTTB10_IRQn                  = 22,        /*!< 16bit TMRB1 compare match detection 0 / Over flow           */
  INTTB11_IRQn                  = 23,        /*!< 16bit TMRB1 compare match detection 1                       */
  INTTB40_IRQn                  = 24,        /*!< 16bit TMRB4 compare match detection 0 / Over flow           */
  INTTB41_IRQn                  = 25,        /*!< 16bit TMRB4 compare match detection 1                       */
  INTTB50_IRQn                  = 26,        /*!< 16bit TMRB5 compare match detection 0 / Over flow           */
  INTTB51_IRQn                  = 27,        /*!< 16bit TMRB5 compare match detection 1                       */
  INTPMD0_IRQn                  = 28,        /*!< PMD0 PWM interrupt                                          */
  INTPMD1_IRQn                  = 29,        /*!< PMD1 PWM interrupt                                          */
  INTCAP00_IRQn                 = 30,        /*!< 16bit TMRB0 input capture 0                                 */
  INTCAP01_IRQn                 = 31,        /*!< 16bit TMRB0 input capture 1                                 */
  INTCAP10_IRQn                 = 32,        /*!< 16bit TMRB1 input capture 0                                 */
  INTCAP11_IRQn                 = 33,        /*!< 16bit TMRB1 input capture 1                                 */
  INTCAP40_IRQn                 = 34,        /*!< 16bit TMRB4 input capture 0                                 */
  INTCAP41_IRQn                 = 35,        /*!< 16bit TMRB4 input capture 1                                 */
  INTCAP50_IRQn                 = 36,        /*!< 16bit TMRB5 input capture 0                                 */
  INTCAP51_IRQn                 = 37,        /*!< 16bit TMRB5 input capture 1                                 */
  INT6_IRQn                     = 38,        /*!< Interrupt pin (PE6/TB3IN/INT6)                              */
  INT7_IRQn                     = 39,        /*!< Interrupt pin (PE7/TB3OUT/INT7)                             */
  INTRX2_IRQn                   = 40,        /*!< Serial reception (channel 2)                                */
  INTTX2_IRQn                   = 41,        /*!< Serial transmit (channel 2)                                 */
  INTADACPA_IRQn                = 42,        /*!< ADCA conversion monitoring function interrupt A             */
  INTADBCPA_IRQn                = 43,        /*!< ADCB conversion monitoring function interrupt A             */
  INTADACPB_IRQn                = 44,        /*!< ADCA conversion monitoring function interrupt B             */
  INTADBCPB_IRQn                = 45,        /*!< ADCB conversion monitoring function interrupt B             */
  INTTB20_IRQn                  = 46,        /*!< 16bit TMRB2 compare match detection 0 / Over flow           */
  INTTB21_IRQn                  = 47,        /*!< 16bit TMRB2 compare match detection 1                       */
  INTTB30_IRQn                  = 48,        /*!< 16bit TMRB3 compare match detection 0 / Over flow           */
  INTTB31_IRQn                  = 49,        /*!< 16bit TMRB3 compare match detection 1                       */
  INTCAP20_IRQn                 = 50,        /*!< 16bit TMRB2 input capture 0                                 */
  INTCAP21_IRQn                 = 51,        /*!< 16bit TMRB2 input capture 1                                 */
  INTCAP30_IRQn                 = 52,        /*!< 16bit TMRB3 input capture 0                                 */
  INTCAP31_IRQn                 = 53,        /*!< 16bit TMRB3 input capture 1                                 */
  INTADASFT_IRQn                = 54,        /*!< ADC unit A conversion started by software is finished       */
  INTADBSFT_IRQn                = 55,        /*!< ADC unit B conversion started by software is finished       */
  INTADATMR_IRQn                = 56,        /*!< ADC unit A conversion triggered by timer is finished        */
  INTADBTMR_IRQn                = 57,        /*!< ADC unit B conversion triggered by timer is finished        */
  INT8_IRQn                     = 58,        /*!< Interrupt pin (PA7/TB4IN/INT8)                              */
  INT9_IRQn                     = 59,        /*!< Interrupt pin (PD3/INT9)                                    */
  INTA_IRQn                     = 60,        /*!< Interrupt pin (PL1/CA_RX/INTA)                              */
  INTB_IRQn                     = 61,        /*!< Interrupt pin (PL0/CA_TX/INTB)                              */
  INTENC00_IRQn                 = 62,        /*!< Encoder 0 interrupt 0                                       */
  INTENC01_IRQn                 = 63,        /*!< Encoder 0 interrupt 1                                       */
  INTRX3_IRQn                   = 64,        /*!< Serial reception (channel 3)                                */
  INTTX3_IRQn                   = 65,        /*!< Serial transmit (channel 3)                                 */
  INTTB60_IRQn                  = 66,        /*!< 16bit TMRB6 compare match detection 0 / Over flow           */
  INTTB61_IRQn                  = 67,        /*!< 16bit TMRB6 compare match detection 1                       */
  INTTB70_IRQn                  = 68,        /*!< 16bit TMRB7 compare match detection 0 / Over flow           */
  INTTB71_IRQn                  = 69,        /*!< 16bit TMRB7 compare match detection 1                       */
  INTCAP60_IRQn                 = 70,        /*!< 16bit TMRB6 input capture 0                                 */
  INTCAP61_IRQn                 = 71,        /*!< 16bit TMRB6 input capture 1                                 */
  INTCAP70_IRQn                 = 72,        /*!< 16bit TMRB7 input capture 0                                 */
  INTCAP71_IRQn                 = 73,        /*!< 16bit TMRB7 input capture 1                                 */
  INTC_IRQn                     = 74,        /*!< Interrupt pin (PJ6/AINB9/INTC)                              */
  INTD_IRQn                     = 75,        /*!< Interrupt pin (PJ7/AINB10/INTD)                             */
  INTE_IRQn                     = 76,        /*!< Interrupt pin (PK0/TRACEDATA3/INTE)                         */
  INTF_IRQn                     = 77,        /*!< Interrupt pin (PK1/TRACEDATA2/INTF)                         */
  INTVCT0_IRQn                  = 78,        /*!< Vector Engine 0 task is finished                            */
  INTVCT1_IRQn                  = 79,        /*!< Vector Engine 1 task is finished                            */
  INTSBI0_IRQn                  = 80,        /*!< Serial bus interface                                        */
  INTCANRX_IRQn                 = 81,        /*!< CAN transmit completion interrupt                           */
  INTCANTX_IRQn                 = 82,        /*!< CAN receive completion interrupt                            */
  INTCANGB_IRQn                 = 83,        /*!< CAN Global status interrupt                                 */
  INTTB80_IRQn                  = 84,        /*!< 16bit TMRB8 compare match detection 0 / Over flow           */
  INTTB81_IRQn                  = 85,        /*!< 16bit TMRB8 compare match detection 1                       */
  INTTB90_IRQn                  = 86,        /*!< 16bit TMRB9 compare match detection 0 / Over flow           */
  INTTB91_IRQn                  = 87,        /*!< 16bit TMRB9 compare match detection 1                       */
  INTCAP80_IRQn                 = 88,        /*!< 16bit TMRB8 input capture 0                                 */
  INTCAP81_IRQn                 = 89,        /*!< 16bit TMRB8 input capture 1                                 */
  INTCAP90_IRQn                 = 90,        /*!< 16bit TMRB9 input capture 0                                 */
  INTCAP91_IRQn                 = 91,        /*!< 16bit TMRB9 input capture 1                                 */
  INTDMACATC_IRQn               = 92,        /*!< DMA end of transfer                                         */
  INTDMACAERR_IRQn              = 93,        /*!< DMA transfer error                                          */
  INTENC10_IRQn                 = 94,        /*!< Encoder 1 interrupt 0                                       */
  INTENC11_IRQn                 = 95         /*!< Encoder 1 interrupt 1                                       */
} IRQn_Type;

