iarsystems/ewarm-toshiba-example-projects/TMPM475/Libraries/TX04_CMSIS/TMPM475.h
/* Vector Engine (VE) */
#define TSB_VE0_EN_VEEN                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->EN,0)))
#define TSB_VE0_EN_VEIDLEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->EN,1)))
#define TSB_VE0_ERRINTEN_VERREN                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->ERRINTEN,0)))
#define TSB_VE0_ERRINTEN_INTTEN                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->ERRINTEN,2)))
#define TSB_VE0_SCHTASKRUN_VRSCH                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_VE0->SCHTASKRUN,0)))
#define TSB_VE0_MCTLF_LAVF                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->MCTLF,0)))
#define TSB_VE0_MCTLF_LAVFM                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->MCTLF,1)))
#define TSB_VE0_MCTLF_LVTF                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->MCTLF,2)))
#define TSB_VE0_MCTLF_PLSLF                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->MCTLF,4)))
#define TSB_VE0_MCTLF_PLSLFM                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->MCTLF,5)))
#define TSB_VE0_MCTLF_PIDOVF                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->MCTLF,8)))
#define TSB_VE0_MCTLF_PIQOVF                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->MCTLF,9)))
#define TSB_VE0_MCTLF_VSOVF                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->MCTLF,10)))
#define TSB_VE0_MCTLF_PWMOVF                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->MCTLF,11)))
#define TSB_VE0_MODE_PVIEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->MODE,0)))
#define TSB_VE0_MODE_ZIEN                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->MODE,1)))
#define TSB_VE0_MODE_VDCSEL                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->MODE,4)))
#define TSB_VE0_MODE_CLPEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->MODE,7)))
#define TSB_VE0_MODE_T5ECEN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->MODE,10)))
#define TSB_VE0_MODE_NICEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->MODE,11)))
#define TSB_VE0_MODE_PWMBLEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->MODE,12)))
#define TSB_VE0_MODE_PWMFLEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->MODE,13)))
#define TSB_VE0_MODE_PMDDTCEN                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->MODE,14)))
#define TSB_VE0_MODE_IPDEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->MODE,15)))
#define TSB_VE0_FMODE_C2PEN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->FMODE,0)))
#define TSB_VE0_FMODE_SPWMEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->FMODE,1)))
#define TSB_VE0_FMODE_IAPLMD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->FMODE,5)))
#define TSB_VE0_FMODE_IBPLMD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->FMODE,6)))
#define TSB_VE0_FMODE_ICPLMD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->FMODE,7)))
#define TSB_VE0_FMODE_CRCEN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->FMODE,8)))
#define TSB_VE0_FMODE_MREGDIS                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->FMODE,9)))
#define TSB_VE0_FMODE_PHCVDIS                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->FMODE,12)))
#define TSB_VE0_FMODE_SADCEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->FMODE,13)))
#define TSB_VE0_OUTCR_UPWM                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->OUTCR,6)))
#define TSB_VE0_OUTCR_VPWM                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->OUTCR,7)))
#define TSB_VE0_OUTCR_WPWM                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->OUTCR,8)))
#define TSB_VE0_EMGRS_EMGRS                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE0->EMGRS,0)))

#define TSB_VE1_EN_VEEN                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE1->EN,0)))
#define TSB_VE1_EN_VEIDLEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE1->EN,1)))
#define TSB_VE1_ERRINTEN_VERREN                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE1->ERRINTEN,0)))
#define TSB_VE1_ERRINTEN_INTTEN                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE1->ERRINTEN,2)))
#define TSB_VE1_SCHTASKRUN_VRSCH                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_VE1->SCHTASKRUN,0)))
#define TSB_VE1_MCTLF_LAVF                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE1->MCTLF,0)))
#define TSB_VE1_MCTLF_LAVFM                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE1->MCTLF,1)))
#define TSB_VE1_MCTLF_LVTF                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE1->MCTLF,2)))
#define TSB_VE1_MCTLF_PLSLF                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE1->MCTLF,4)))
#define TSB_VE1_MCTLF_PLSLFM                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE1->MCTLF,5)))
#define TSB_VE1_MCTLF_PIDOVF                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE1->MCTLF,8)))
#define TSB_VE1_MCTLF_PIQOVF                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE1->MCTLF,9)))
#define TSB_VE1_MCTLF_VSOVF                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE1->MCTLF,10)))
#define TSB_VE1_MCTLF_PWMOVF                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE1->MCTLF,11)))
#define TSB_VE1_MODE_PVIEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE1->MODE,0)))
#define TSB_VE1_MODE_ZIEN                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE1->MODE,1)))
#define TSB_VE1_MODE_VDCSEL                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE1->MODE,4)))
#define TSB_VE1_MODE_CLPEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE1->MODE,7)))
#define TSB_VE1_MODE_T5ECEN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE1->MODE,10)))
#define TSB_VE1_MODE_NICEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE1->MODE,11)))
#define TSB_VE1_MODE_PWMBLEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE1->MODE,12)))
#define TSB_VE1_MODE_PWMFLEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE1->MODE,13)))
#define TSB_VE1_MODE_PMDDTCEN                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE1->MODE,14)))
#define TSB_VE1_MODE_IPDEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE1->MODE,15)))
#define TSB_VE1_FMODE_C2PEN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE1->FMODE,0)))
#define TSB_VE1_FMODE_SPWMEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE1->FMODE,1)))
#define TSB_VE1_FMODE_IAPLMD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE1->FMODE,5)))
#define TSB_VE1_FMODE_IBPLMD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE1->FMODE,6)))
#define TSB_VE1_FMODE_ICPLMD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE1->FMODE,7)))
#define TSB_VE1_FMODE_CRCEN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE1->FMODE,8)))
#define TSB_VE1_FMODE_MREGDIS                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE1->FMODE,9)))
#define TSB_VE1_FMODE_PHCVDIS                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE1->FMODE,12)))
#define TSB_VE1_FMODE_SADCEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE1->FMODE,13)))
#define TSB_VE1_OUTCR_UPWM                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE1->OUTCR,6)))
#define TSB_VE1_OUTCR_VPWM                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE1->OUTCR,7)))
#define TSB_VE1_OUTCR_WPWM                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE1->OUTCR,8)))
#define TSB_VE1_EMGRS_EMGRS                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE1->EMGRS,0)))


